In [2]:
import pandas as pd

In [3]:
virk = pd.read_csv('/storage/EnhetOrgformVirksomhetArtBransje.tab', sep='\t', encoding = "ISO-8859-1")

In [4]:
len(virk)

1901937

In [5]:
virk.head()

,orgnr,orgform,linjenr,tekst
0,810033622,AS,1,"Handel, engros og detalj og agenturer, herunder"
1,810033622,AS,2,import av varer.
2,810034882,AS,10,"Handel og innstallasjonsvirksomhet, eller anne..."
3,810034882,AS,20,"med dette, samt delta I annen virksomhet."
4,810059672,AS,10,Utleie av forretningseiendommer.

In [6]:
virk = virk.sort_values(by=['orgnr', 'linjenr'])

In [7]:
virk.head()

,orgnr,orgform,linjenr,tekst
0,810033622,AS,1,"Handel, engros og detalj og agenturer, herunder"
1,810033622,AS,2,import av varer.
2,810034882,AS,10,"Handel og innstallasjonsvirksomhet, eller anne..."
3,810034882,AS,20,"med dette, samt delta I annen virksomhet."
4,810059672,AS,10,Utleie av forretningseiendommer.

Hmmm... need to aggregate text... In the right order. In Oracle this would be with listagg... But in Python...

In [55]:
virkagg = pd.DataFrame(virk.groupby('orgnr')['tekst'].apply(list))

In [56]:
virkagg['text2'] = virkagg['tekst'].apply(lambda x: ' '.join(x))

In [57]:
virkagg = virkagg.drop(['tekst'], axis=1)

In [80]:
len(virkagg)

1102419

## NACE

In [22]:
nace = pd.read_csv('/storage/EnhetNacekode.tab', sep='\t', encoding = "ISO-8859-1")

In [23]:
len(nace)

1105014

In [24]:
nace.dtypes

orgnr           int64
rekkefolge      int64
nacekode      float64
dtype: object

In [25]:
nace.head()

       orgnr  rekkefolge  nacekode
0  810033622           1    68.209
1  810034882           1    43.210
2  810034882           2    47.592
3  810059672           1    68.209
4  810093382           1    68.209

In [29]:
nace.groupby('rekkefolge').agg({'rekkefolge': len})

            rekkefolge
rekkefolge
1              1070788
2                32658
3                 1567
4                    1

In [34]:
nace1 = nace.query("rekkefolge==1")

In [58]:
nace1 = nace1.drop(['rekkefolge'], axis=1)

In [81]:
len(nace1)

1070788

In [77]:
nace1.head()

       orgnr  nacekode
0  810033622    68.209
1  810034882    43.210
3  810059672    68.209
4  810093382    68.209
5  810094532    58.130

In [87]:
len(virkagg)

1102419

In [86]:
len(nace1)

1070788

In [88]:
virknace = nace1.join(virkagg, on='orgnr', how='inner')

In [90]:
len(virknace)

1049701

In [92]:
virknace.head()

       orgnr  nacekode                                              text2
0  810033622    68.209  Handel, engros og detalj og agenturer, herunde...
1  810034882    43.210  Handel og innstallasjonsvirksomhet, eller anne...
3  810059672    68.209                   Utleie av forretningseiendommer.
4  810093382    68.209  Eie og drift av fast eiendom, investering i ak...
5  810094532    58.130  Utgi avisen Agderposten og drive annen virksom...

## Slettede

In [71]:
nace_slettede = pd.read_csv('/storage/EnhetNacekodeSlettede.tab', sep='\t', encoding = "ISO-8859-1")

In [61]:
virk_slettede = pd.read_csv('/storage/EnhetOrgformVirksomhetArtBransjeSlettede.tab', sep='\t', encoding = "ISO-8859-1")

In [64]:
virkagg_slettede = pd.DataFrame(virk_slettede.groupby('orgnr')['tekst'].apply(list))

In [66]:
virkagg_slettede['text2'] = virkagg_slettede['tekst'].apply(lambda x: ' '.join(x))

In [68]:
virkagg_slettede = virkagg_slettede.drop('tekst', axis=1)

In [69]:
virkagg_slettede.head()

                                                       text2
orgnr
810006862  Drive bunkersmegling, oljehandel og alt hva de...
810023112  Import og salg av anleggsmaskiner og deler til...
810027932  Drive handel detalj og beslektede aktiviteter,...
810037342  Handel samt eie og disponere fast eiendom og h...
810044292  Salg og produksjon av bedriftsprofilerende pro...

In [73]:
nace_slettede1 = nace_slettede.query('rekkefolge==1')

In [74]:
nace_slettede1 = nace_slettede1.drop('rekkefolge', axis=1)

In [93]:
virknace_slettede = nace_slettede1.join(virkagg_slettede, on='orgnr', how='inner')

In [94]:
len(virknace_slettede)

505188

In [95]:
virknace_slettede.head()

       orgnr  nacekode                                              text2
0  810006862    52.229  Drive bunkersmegling, oljehandel og alt hva de...
1  810023112    46.630  Import og salg av anleggsmaskiner og deler til...
2  810037342    68.209  Handel samt eie og disponere fast eiendom og h...
3  810090812    58.130  Utgi Adresseavisen som konservativt blad og å ...
4  810114622    47.610  Drive bokhandel og annen virksomhet som står i...

In [96]:
allvirk = pd.concat([virknace_slettede, virknace])

In [97]:
len(allvirk)

1554889

In [99]:
allvirk.head()

       orgnr  nacekode                                              text2
0  810006862    52.229  Drive bunkersmegling, oljehandel og alt hva de...
1  810023112    46.630  Import og salg av anleggsmaskiner og deler til...
2  810037342    68.209  Handel samt eie og disponere fast eiendom og h...
3  810090812    58.130  Utgi Adresseavisen som konservativt blad og å ...
4  810114622    47.610  Drive bokhandel og annen virksomhet som står i...

In [101]:
allvirk.reset_index().to_feather('/storage/alle_virksomheter.feather')